# Pandas

In [1]:
import numpy as np #importing numpy 
import pandas as pd #importing pandas

In [2]:
s=pd.DataFrame(np.arange(0,16).reshape(4,4),index=['a','b','c','d'],columns=['s1','s2','s3','s4'])

In [3]:
s.head()

   s1  s2  s3  s4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [4]:
s.to_csv('Test1.csv')

In [5]:
#accessing the elements
#locating
s.loc['d']
s
type(s.loc['d'])

pandas.core.series.Series

In [6]:
s.loc['d']

s1    12
s2    13
s3    14
s4    15
Name: d, dtype: int32

In [7]:
s.iloc[1:3,1:3]

   s2  s3
b   5   6
c   9  10

In [8]:
type(s.iloc[1:3,1:3])

pandas.core.frame.DataFrame

In [9]:
type(s.iloc[1:3,0]) #this is not a Dataframe

pandas.core.series.Series

In [10]:
#convert Dataframe into arrays
s.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [11]:
s.isnull().sum()

s1    0
s2    0
s3    0
s4    0
dtype: int64

In [12]:
s

   s1  s2  s3  s4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [13]:
s['s1'].value_counts()

0     1
8     1
4     1
12    1
Name: s1, dtype: int64

In [14]:
s['s1'].unique()

array([ 0,  4,  8, 12])

In [15]:
s['s1']

a     0
b     4
c     8
d    12
Name: s1, dtype: int32

In [16]:
#Reading a csv file
s

   s1  s2  s3  s4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [17]:
s=pd.read_csv('Import_User_Sample_en.csv')

In [18]:
s.head()

,User Name,First Name,Last Name,Display Name,Job Title,Department,Office Number,Office Phone,Mobile Phone,Fax,Address,City,State or Province,ZIP or Postal Code,Country or Region
0,chris@contoso.com,Chris,Green,Chris Green,IT Manager,Information Technology,123451,123-555-1211,123-555-6641,123-555-9821,1 Microsoft way,Redmond,Wa,98052,United States
1,ben@contoso.com,Ben,Andrews,Ben Andrews,IT Manager,Information Technology,123452,123-555-1212,123-555-6642,123-555-9822,1 Microsoft way,Redmond,Wa,98052,United States
2,david@contoso.com,David,Longmuir,David Longmuir,IT Manager,Information Technology,123453,123-555-1213,123-555-6643,123-555-9823,1 Microsoft way,Redmond,Wa,98052,United States
3,cynthia@contoso.com,Cynthia,Carey,Cynthia Carey,IT Manager,Information Technology,123454,123-555-1214,123-555-6644,123-555-9824,1 Microsoft way,Redmond,Wa,98052,United States
4,melissa@contoso.com,Melissa,MacBeth,Melissa MacBeth,IT Manager,Information Technology,123455,123-555-1215,123-555-6645,123-555-9825,1 Microsoft way,Redmond,Wa,98052,United States

In [19]:
s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   User Name           5 non-null      object
 1   First Name          5 non-null      object
 2   Last Name           5 non-null      object
 3   Display Name        5 non-null      object
 4   Job Title           5 non-null      object
 5   Department          5 non-null      object
 6   Office Number       5 non-null      int64
 7   Office Phone        5 non-null      object
 8   Mobile Phone        5 non-null      object
 9   Fax                 5 non-null      object
 10  Address             5 non-null      object
 11  City                5 non-null      object
 12  State or Province   5 non-null      object
 13  ZIP or Postal Code  5 non-null      int64
 14  Country or Region   5 non-null      object
dtypes: int64(2), object(13)
memory usage: 728.0+ bytes

In [20]:
s.describe()

       Office Number  ZIP or Postal Code
count       5.000000                 5.0
mean   123453.000000             98052.0
std         1.581139                 0.0
min    123451.000000             98052.0
25%    123452.000000             98052.0
50%    123453.000000             98052.0
75%    123454.000000             98052.0
max    123455.000000             98052.0

In [21]:
test_df=pd.read_csv('Test1.csv')

In [22]:
test_df.head()

  Unnamed: 0  s1  s2  s3  s4
0          a   0   1   2   3
1          b   4   5   6   7
2          c   8   9  10  11
3          d  12  13  14  15

In [23]:
 test_df['s1'].value_counts()

0     1
8     1
4     1
12    1
Name: s1, dtype: int64

In [24]:
from io import StringIO,BytesIO

In [25]:
data=('col1,col2,col3\n'
         'a,b,c\n'
         'd,e,f\n'
         'g,h,i')

In [26]:
type(data)

str

In [27]:
StringIO()

In [28]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    a    b    c
1    d    e    f
2    g    h    i

In [29]:
d=pd.read_csv(StringIO(data),usecols=['col1','col2'] )

In [30]:
d

  col1 col2
0    a    b
1    d    e
2    g    h

In [31]:
d.to_csv('tbl.csv')

In [32]:
d

  col1 col2
0    a    b
1    d    e
2    g    h

In [33]:
print(data)

col1,col2,col3
a,b,c
d,e,f
g,h,i

In [34]:
df=pd.read_csv(StringIO(data),dtype=object) #Making df as object type

In [35]:
df

  col1 col2 col3
0    a    b    c
1    d    e    f
2    g    h    i

In [36]:
type(df['col1'][2])

str

In [37]:
df['col1'][2]

'g'

In [38]:
num=('col1,col2,col3\n'
         '1,2,3\n'
         '4,5,6\n'
         '7,8,9')

In [39]:
df=pd.read_csv(StringIO(num),dtype=float) #we can specify any data type for e.g float,int64,chr etc

In [40]:
df

   col1  col2  col3
0   1.0   2.0   3.0
1   4.0   5.0   6.0
2   7.0   8.0   9.0

In [41]:
df=pd.read_csv(StringIO(num),dtype={'col1':float,'col2':int,'col3':'int64'})#we can also specify multiple data type by using dict

In [42]:
df

   col1  col2  col3
0   1.0     2     3
1   4.0     5     6
2   7.0     8     9

In [43]:
df['col3'][2]

9

In [44]:
type(df['col3'][2])

numpy.int64

In [62]:
dt=('subject,marks_obtained,full_marks\n'
   'History,80,100\n'
   'Geography,60,100\n')

In [53]:
type(dt)

str

In [63]:
dt_frm=pd.read_csv(StringIO(dt),index_col=0) #Making any columns as index

In [64]:
dt_frm

           marks_obtained  full_marks
subject
History                80         100
Geography              60         100

In [75]:
dt2=('a,b,c\n'
    '1,apple,banana\n'
    '2,Orange,grapes')

In [66]:
dt1

'a,b,c\n1,apple,banana\n2,Orange,grapes'

In [73]:
dt_frm1=pd.read_csv(StringIO(dt1),index_col=False)

In [74]:
dt_frm1

   a       b       c
0  1   apple  banana
1  2  Orange  grapes

In [76]:
dt_frm2=pd.read_csv(StringIO(dt2))

In [77]:
dt_frm2

   a       b       c
0  1   apple  banana
1  2  Orange  grapes

In [78]:
data

'col1,col2,col3\na,b,c\nd,e,f\ng,h,i'

In [80]:
dt_frm2=pd.read_csv(StringIO(dt2),usecols=['b','c'])

In [81]:
dt_frm2

        b       c
0   apple  banana
1  Orange  grapes

In [131]:
#Quoting and Escaping Character
data1=('a,b\n"hello\\"Navil\\"How are you?",9')

In [127]:
type(data1)

str

In [133]:
df=pd.read_csv(StringIO(data1),escapechar='\\')

In [134]:
df

                          a  b
0  hello"Navil"How are you?  9

# Pandas reading jason,pickle&excel

In [4]:
import pandas as pd

In [27]:
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df1=pd.read_json(Data)

In [29]:
df1

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [10]:
type(Data)

str

In [19]:
pd.read_json(Data)

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [23]:
#Read data from URL
df=pd.read_json('https://file-examples-com.github.io/uploads/2017/02/file_example_JSON_1kb.json',)

In [21]:
df.head()

                                     countries
0     {'name': 'Afghanistan', 'isoCode': 'AF'}
1         {'name': 'Albania', 'isoCode': 'AL'}
2         {'name': 'Algeria', 'isoCode': 'DZ'}
3  {'name': 'American Samoa', 'isoCode': 'AS'}
4         {'name': 'Andorra', 'isoCode': 'AD'}

In [24]:
df.to_csv('file_example_JSON_1kb.csv')

In [26]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df1.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [37]:
df.to_json(orient='records')

'[{"countries":{"name":"Afghanistan","isoCode":"AF"}},{"countries":{"name":"Albania","isoCode":"AL"}},{"countries":{"name":"Algeria","isoCode":"DZ"}},{"countries":{"name":"American Samoa","isoCode":"AS"}},{"countries":{"name":"Andorra","isoCode":"AD"}},{"countries":{"name":"Angola","isoCode":"AO"}},{"countries":{"name":"Anguilla","isoCode":"AI"}},{"countries":{"name":"Antarctica","isoCode":"AQ"}},{"countries":{"name":"Antigua and Barbuda","isoCode":"AG"}},{"countries":{"name":"Argentina","isoCode":"AR"}},{"countries":{"name":"Armenia","isoCode":"AM"}},{"countries":{"name":"Aruba","isoCode":"AW"}},{"countries":{"name":"Australia","isoCode":"AU"}},{"countries":{"name":"Austria","isoCode":"AT"}},{"countries":{"name":"Azerbaijan","isoCode":"AZ"}},{"countries":{"name":"Bahamas","isoCode":"BS"}},{"countries":{"name":"Bahrain","isoCode":"BH"}},{"countries":{"name":"Bangladesh","isoCode":"BD"}},{"countries":{"name":"Barbados","isoCode":"BB"}},{"countries":{"name":"Belarus","isoCode":"BY"}},{"countries":{"name":"Belgium","isoCode":"BE"}},{"countries":{"name":"Belize","isoCode":"BZ"}},{"countries":{"name":"Benin","isoCode":"BJ"}},{"countries":{"name":"Bermuda","isoCode":"BM"}},{"countries":{"name":"Bhutan","isoCode":"BT"}},{"countries":{"name":"Bolivia","isoCode":"BO"}},{"countries":{"name":"Bosnia and Herzegovina","isoCode":"BA"}},{"countries":{"name":"Botswana","isoCode":"BW"}},{"countries":{"name":"Bouvet Island","isoCode":"BV"}},{"countries":{"name":"Brazil","isoCode":"BR"}},{"countries":{"name":"British Indian Ocean Territory","isoCode":"IO"}},{"countries":{"name":"Brunei","isoCode":"BN"}},{"countries":{"name":"Bulgaria","isoCode":"BG"}},{"countries":{"name":"Burkina Faso","isoCode":"BF"}},{"countries":{"name":"Burundi","isoCode":"BI"}},{"countries":{"name":"Cambodia","isoCode":"KH"}},{"countries":{"name":"Cameroon","isoCode":"CM"}},{"countries":{"name":"Canada","isoCode":"CA"}},{"countries":{"name":"Cape Verde","isoCode":"CV"}},{"countries":{"name":"Cayman Islands","isoCode":"KY"}},{"countries":{"name":"Central African Republic","isoCode":"CF"}},{"countries":{"name":"Chad","isoCode":"TD"}},{"countries":{"name":"Chile","isoCode":"CL"}},{"countries":{"name":"China","isoCode":"CN"}},{"countries":{"name":"Christmas Island","isoCode":"CX"}},{"countries":{"name":"Cocos (Keeling) Islands","isoCode":"CC"}},{"countries":{"name":"Colombia","isoCode":"CO"}},{"countries":{"name":"Comoros","isoCode":"KM"}},{"countries":{"name":"Congo","isoCode":"CG"}},{"countries":{"name":"Cook Islands","isoCode":"CK"}},{"countries":{"name":"Costa Rica","isoCode":"CR"}},{"countries":{"name":"Croatia","isoCode":"HR"}},{"countries":{"name":"Cuba","isoCode":"CU"}},{"countries":{"name":"Cyprus","isoCode":"CY"}},{"countries":{"name":"Czech Republic","isoCode":"CZ"}},{"countries":{"name":"Denmark","isoCode":"DK"}},{"countries":{"name":"Djibouti","isoCode":"DJ"}},{"countries":{"name":"Dominica","isoCode":"DM"}},{"countries":{"name":"Dominican Republic","isoCode":"DO"}},{"countries":{"name":"East Timor","isoCode":"TP"}},{"countries":{"name":"Ecuador","isoCode":"EC"}},{"countries":{"name":"Egypt","isoCode":"EG"}},{"countries":{"name":"El Salvador","isoCode":"SV"}},{"countries":{"name":"Equatorial Guinea","isoCode":"GQ"}},{"countries":{"name":"Eritrea","isoCode":"ER"}},{"countries":{"name":"Estonia","isoCode":"EE"}},{"countries":{"name":"Ethiopia","isoCode":"ET"}},{"countries":{"name":"Falkland Islands","isoCode":"FK"}},{"countries":{"name":"Faroe Islands","isoCode":"FO"}},{"countries":{"name":"Fiji Islands","isoCode":"FJ"}},{"countries":{"name":"Finland","isoCode":"FI"}},{"countries":{"name":"France","isoCode":"FR"}},{"countries":{"name":"French Guiana","isoCode":"GF"}},{"countries":{"name":"French Polynesia","isoCode":"PF"}},{"countries":{"name":"French Southern territories","isoCode":"TF"}},{"countries":{"name":"Gabon","isoCode":"GA"}},{"countries":{"name":"Gambia","isoCode":"GM"}},{"countries":{"name":"Georgia","isoCode":"GE"}},{"countries":{"name":"Germany","isoCode":"DE"}},{"countries":{"name":"Ghana","isoCode":"GH"}},{"countries":{"name":"Gibraltar","isoCode":"GI"}},{"countries":{"name":"Greece","isoCode":"GR"}},{"countries":{"name":"Greenland","isoCode":"GL"}},{"countries":{"name":"Grenada","isoCode":"GD"}},{"countries":{"name":"Guadeloupe","isoCode":"GP"}},{"countries":{"name":"Guam","isoCode":"GU"}},{"countries":{"name":"Guatemala","isoCode":"GT"}},{"countries":{"name":"Guernsey","isoCode":"GG"}},{"countries":{"name":"Guinea","isoCode":"GN"}},{"countries":{"name":"Guinea-Bissau","isoCode":"GW"}},{"countries":{"name":"Guyana","isoCode":"GY"}},{"countries":{"name":"Haiti","isoCode":"HT"}},{"countries":{"name":"Heard Island and McDonald Islands","isoCode":"HM"}},{"countries":{"name":"Holy See (Vatican City State)","isoCode":"VA"}},{"countries":{"name":"Honduras","isoCode":"HN"}},{"countries":{"name":"Hong Kong","isoCode":"HK"}},{"countries":{"name":"Hungary","isoCode":"HU"}},{"countries":{"name":"Iceland","isoCode":"IS"}},{"countries":{"name":"India","isoCode":"IN"}},{"countries":{"name":"Indonesia","isoCode":"ID"}},{"countries":{"name":"Iran","isoCode":"IR"}},{"countries":{"name":"Iraq","isoCode":"IQ"}},{"countries":{"name":"Ireland","isoCode":"IE"}},{"countries":{"name":"Isle of Man","isoCode":"IM"}},{"countries":{"name":"Israel","isoCode":"IL"}},{"countries":{"name":"Italy","isoCode":"IT"}},{"countries":{"name":"Ivory Coast","isoCode":"CI"}},{"countries":{"name":"Jamaica","isoCode":"JM"}},{"countries":{"name":"Japan","isoCode":"JP"}},{"countries":{"name":"Jersey","isoCode":"JE"}},{"countries":{"name":"Jordan","isoCode":"JO"}},{"countries":{"name":"Kazakhstan","isoCode":"KZ"}},{"countries":{"name":"Kenya","isoCode":"KE"}},{"countries":{"name":"Kiribati","isoCode":"KI"}},{"countries":{"name":"Kuwait","isoCode":"KW"}},{"countries":{"name":"Kyrgyzstan","isoCode":"KG"}},{"countries":{"name":"Laos","isoCode":"LA"}},{"countries":{"name":"Latvia","isoCode":"LV"}},{"countries":{"name":"Lebanon","isoCode":"LB"}},{"countries":{"name":"Lesotho","isoCode":"LS"}},{"countries":{"name":"Liberia","isoCode":"LR"}},{"countries":{"name":"Libyan Arab Jamahiriya","isoCode":"LY"}},{"countries":{"name":"Liechtenstein","isoCode":"LI"}},{"countries":{"name":"Lithuania","isoCode":"LT"}},{"countries":{"name":"Luxembourg","isoCode":"LU"}},{"countries":{"name":"Macao","isoCode":"MO"}},{"countries":{"name":"North Macedonia","isoCode":"MK"}},{"countries":{"name":"Madagascar","isoCode":"MG"}},{"countries":{"name":"Malawi","isoCode":"MW"}},{"countries":{"name":"Malaysia","isoCode":"MY"}},{"countries":{"name":"Maldives","isoCode":"MV"}},{"countries":{"name":"Mali","isoCode":"ML"}},{"countries":{"name":"Malta","isoCode":"MT"}},{"countries":{"name":"Marshall Islands","isoCode":"MH"}},{"countries":{"name":"Martinique","isoCode":"MQ"}},{"countries":{"name":"Mauritania","isoCode":"MR"}},{"countries":{"name":"Mauritius","isoCode":"MU"}},{"countries":{"name":"Mayotte","isoCode":"YT"}},{"countries":{"name":"Mexico","isoCode":"MX"}},{"countries":{"name":"Micronesia, Federated States of","isoCode":"FM"}},{"countries":{"name":"Moldova","isoCode":"MD"}},{"countries":{"name":"Monaco","isoCode":"MC"}},{"countries":{"name":"Mongolia","isoCode":"MN"}},{"countries":{"name":"Montenegro","isoCode":"ME"}},{"countries":{"name":"Montserrat","isoCode":"MS"}},{"countries":{"name":"Morocco","isoCode":"MA"}},{"countries":{"name":"Mozambique","isoCode":"MZ"}},{"countries":{"name":"Myanmar","isoCode":"MM"}},{"countries":{"name":"Namibia","isoCode":"NA"}},{"countries":{"name":"Nauru","isoCode":"NR"}},{"countries":{"name":"Nepal","isoCode":"NP"}},{"countries":{"name":"Netherlands","isoCode":"NL"}},{"countries":{"name":"Netherlands Antilles","isoCode":"AN"}},{"countries":{"name":"New Caledonia","isoCode":"NC"}},{"countries":{"name":"New Zealand","isoCode":"NZ"}},{"countries":{"name":"Nicaragua","isoCode":"NI"}},{"countries":{"name":"Niger","isoCode":"NE"}},{"countries":{"name":"Nigeria","isoCode":"NG"}},{"countries":{"name":"Niue","isoCode":"NU"}},{"countries":{"name":"Norfolk Island","isoCode":"NF"}},{"countries":{"name":"North Korea","isoCode":"KP"}},{"countries":{"name":"Northern Ireland","isoCode":"GB"}},{"countries":{"name":"Northern Mariana Islands","isoCode":"MP"}},{"countries":{"name":"Norway","isoCode":"NO"}},{"countries":{"name":"Oman","isoCode":"OM"}},{"countries":{"name":"Pakistan","isoCode":"PK"}},{"countries":{"name":"Palau","isoCode":"PW"}},{"countries":{"name":"Palestine","isoCode":"PS"}},{"countries":{"name":"Panama","isoCode":"PA"}},{"countries":{"name":"Papua New Guinea","isoCode":"PG"}},{"countries":{"name":"Paraguay","isoCode":"PY"}},{"countries":{"name":"Peru","isoCode":"PE"}},{"countries":{"name":"Philippines","isoCode":"PH"}},{"countries":{"name":"Pitcairn","isoCode":"PN"}},{"countries":{"name":"Poland","isoCode":"PL"}},{"countries":{"name":"Portugal","isoCode":"PT"}},{"countries":{"name":"Puerto Rico","isoCode":"PR"}},{"countries":{"name":"Qatar","isoCode":"QA"}},{"countries":{"name":"Reunion","isoCode":"RE"}},{"countries":{"name":"Romania","isoCode":"RO"}},{"countries":{"name":"Russian Federation","isoCode":"RU"}},{"countries":{"name":"Rwanda","isoCode":"RW"}},{"countries":{"name":"Saint Helena","isoCode":"SH"}},{"countries":{"name":"Saint Kitts and Nevis","isoCode":"KN"}},{"countries":{"name":"Saint Lucia","isoCode":"LC"}},{"countries":{"name":"Saint Pierre and Miquelon","isoCode":"PM"}},{"countries":{"name":"Saint Vincent and the Grenadines","isoCode":"VC"}},{"countries":{"name":"Samoa","isoCode":"WS"}},{"countries":{"name":"San Marino","isoCode":"SM"}},{"countries":{"name":"Sao Tome and Principe","isoCode":"ST"}},{"countries":{"name":"Saudi Arabia","isoCode":"SA"}},{"countries":{"name":"Senegal","isoCode":"SN"}},{"countries":{"name":"Serbia","isoCode":"RS"}},{"countries":{"name":"Seychelles","isoCode":"SC"}},{"countries":{"name":"Sierra Leone","isoCode":"SL"}},{"countries":{"name":"Singapore","isoCode":"SG"}},{"countries":{"name":"Slovakia","isoCode":"SK"}},{"countries":{"name":"Slovenia","isoCode":"SI"}},{"countries":{"name":"Solomon Islands","isoCode":"SB"}},{"countries":{"name":"Somalia","isoCode":"SO"}},{"countries":{"name":"South Africa","isoCode":"ZA"}},{"countries":{"name":"South Georgia and the South Sandwich Islands","isoCode":"GS"}},{"countries":{"name":"South Korea","isoCode":"KR"}},{"countries":{"name":"South Sudan","isoCode":"SS"}},{"countries":{"name":"Spain","isoCode":"ES"}},{"countries":{"name":"Sri Lanka","isoCode":"LK"}},{"countries":{"name":"Sudan","isoCode":"SD"}},{"countries":{"name":"Suriname","isoCode":"SR"}},{"countries":{"name":"Svalbard and Jan Mayen","isoCode":"SJ"}},{"countries":{"name":"Swaziland","isoCode":"SZ"}},{"countries":{"name":"Sweden","isoCode":"SE"}},{"countries":{"name":"Switzerland","isoCode":"CH"}},{"countries":{"name":"Syria","isoCode":"SY"}},{"countries":{"name":"Tajikistan","isoCode":"TJ"}},{"countries":{"name":"Tanzania","isoCode":"TZ"}},{"countries":{"name":"Thailand","isoCode":"TH"}},{"countries":{"name":"The Democratic Republic of Congo","isoCode":"CD"}},{"countries":{"name":"Timor-Leste","isoCode":"TL"}},{"countries":{"name":"Togo","isoCode":"TG"}},{"countries":{"name":"Tokelau","isoCode":"TK"}},{"countries":{"name":"Tonga","isoCode":"TO"}},{"countries":{"name":"Trinidad and Tobago","isoCode":"TT"}},{"countries":{"name":"Tunisia","isoCode":"TN"}},{"countries":{"name":"Turkey","isoCode":"TR"}},{"countries":{"name":"Turkmenistan","isoCode":"TM"}},{"countries":{"name":"Turks and Caicos Islands","isoCode":"TC"}},{"countries":{"name":"Tuvalu","isoCode":"TV"}},{"countries":{"name":"Uganda","isoCode":"UG"}},{"countries":{"name":"Ukraine","isoCode":"UA"}},{"countries":{"name":"United Arab Emirates","isoCode":"AE"}},{"countries":{"name":"United Kingdom","isoCode":"GB"}},{"countries":{"name":"United States","isoCode":"US"}},{"countries":{"name":"United States Minor Outlying Islands","isoCode":"UM"}},{"countries":{"name":"Uruguay","isoCode":"UY"}},{"countries":{"name":"Uzbekistan","isoCode":"UZ"}},{"countries":{"name":"Vanuatu","isoCode":"VU"}},{"countries":{"name":"Venezuela","isoCode":"VE"}},{"countries":{"name":"Vietnam","isoCode":"VN"}},{"countries":{"name":"Virgin Islands, British","isoCode":"VG"}},{"countries":{"name":"Virgin Islands, U.S.","isoCode":"VI"}},{"countries":{"name":"Wallis and Futuna","isoCode":"WF"}},{"countries":{"name":"Western Sahara","isoCode":"EH"}},{"countries":{"name":"Yemen","isoCode":"YE"}},{"countries":{"name":"Yugoslavia","isoCode":"YU"}},{"countries":{"name":"Zambia","isoCode":"ZM"}},{"countries":{"name":"Zimbabwe","isoCode":"ZW"}}]'

                                       countries
0       {'name': 'Afghanistan', 'isoCode': 'AF'}
1           {'name': 'Albania', 'isoCode': 'AL'}
2           {'name': 'Algeria', 'isoCode': 'DZ'}
3    {'name': 'American Samoa', 'isoCode': 'AS'}
4           {'name': 'Andorra', 'isoCode': 'AD'}
..                                           ...
241  {'name': 'Western Sahara', 'isoCode': 'EH'}
242           {'name': 'Yemen', 'isoCode': 'YE'}
243      {'name': 'Yugoslavia', 'isoCode': 'YU'}
244          {'name': 'Zambia', 'isoCode': 'ZM'}
245        {'name': 'Zimbabwe', 'isoCode': 'ZW'}

[246 rows x 1 columns]